src/Catalogs/СтатьиДвиженияДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>СтатьиДвиженияДенежныхСредств</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЦФОДляБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦФОДляБюджета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегионДляБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегионыДляБюджета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/СтатьиДвиженияДенежныхСредств/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	СтатьиДвиженияДенежныхСредств.Ссылка,
	|	СтатьиДвиженияДенежныхСредств.ЭтоГруппа
	|ИЗ
	|	Справочник.СтатьиДвиженияДенежныхСредств КАК СтатьиДвиженияДенежныхСредств
	|ГДЕ
	|	СтатьиДвиженияДенежныхСредств.Ссылка <> &Ссылка
	|	И СтатьиДвиженияДенежныхСредств.Наименование = &Наименование");
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Наименование", Наименование);
	ТабЗ = Запрос.Выполнить().Выгрузить();
	Если ТабЗ.Количество() > 0 Тогда
		ГруппаУжеЕсть = Ложь;
		Для Каждого Стр Из ТабЗ Цикл
			Если Стр.ЭтоГруппа Тогда
				ГруппаУжеЕсть = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ЭтоГруппа Тогда
			Если ГруппаУжеЕсть Тогда
				#Если Клиент Тогда
					Сообщить("такая группа статей уже создана.");
				#КонецЕсли
				Отказ = Истина;
			КонецЕсли;
		Иначе
			Если НЕ ГруппаУжеЕсть Тогда
				#Если Клиент Тогда
					Сообщить("такая статья уже создана.");
				#КонецЕсли
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЭтотОбъект.Ссылка = Справочники.СтатьиДвиженияДенежныхСредств.СтатьяНеНайдена Тогда
		Если Наименование <> "!!!Статья не найдена" Тогда
			Наименование = "!!!Статья не найдена";
		КонецЕсли;
		Если ЦФОДляБюджета <> Справочники.ЦФОДляБюджета.ПустаяСсылка() Тогда
			ЦФОДляБюджета = Справочники.ЦФОДляБюджета.ПустаяСсылка();
		КонецЕсли;
		Если РегионДляБюджета <> Справочники.РегионыДляБюджета.ПустаяСсылка() Тогда
			РегионДляБюджета = Справочники.РегионыДляБюджета.ПустаяСсылка();
		КонецЕсли;
		Если ОбменДанными.Загрузка Тогда 
			ПланыОбмена.ЗарегистрироватьИзменения(ОбменДаннымиКлиентСервер.ПолучитьИсходящийУзелОбмена(Метаданные.ПланыОбмена.ОбменПартКом77_83, 1), ЭтотОбъект.Ссылка);
		КонецЕсли;
	КонецЕсли;
			
КонецПроцедуры
